src/DataProcessors/ГлавнаяФормаРесторан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ГлавнаяФормаРесторан</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЗаказТоварыДопИнф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаказТоварыДопИнф</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяДозаказ</Name>
					<Comment>Время добавления товара (бдюда) в заказ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЗаказано</Name>
					<Comment>Время отправки для приготовления товара (бдюда)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяГотово</Name>
					<Comment>Время готовности товара (бдюда)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыдано</Name>
					<Comment>Время выдачи товара (бдюда)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Текущее состояние товара (блюда)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПозицийЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодПодтверждения</Name>
					<Comment>Код подтверждения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место с которого был заказан товар (блюдо)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подача</Name>
					<Comment>Подача</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаказано</Name>
					<Comment>Автор заказа позиции в производстве</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторГотово</Name>
					<Comment>Автор подтверждения готовности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУдалено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдСтрокиВладельца</Name>
					<Comment>Идентификатор строки заказа владельца</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМарки</Name>
					<Comment>текущий номер марки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Заказ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСтроки</Name>
					<Comment>Идентификатор строки заказа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыПозицийЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыПозицийЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дозаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТарифВкл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ГлавнаяФормаРесторан/Forms/Производство/module.bsl
Перем МестоПроизводстваСписок;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЖИДАНИЯ

// чтобы часики тикали
//
Процедура ОбновитьДатуВремя()
	
	ТекДата = ТекущаяДата();
	ЭлементыФормы.тДата.Заголовок	= Формат(ТекДата,"ДФ='dd.MM.yyyy (ddd)'");
	ЭлементыФормы.тВремя.Заголовок	= Формат(ТекДата,"ДЛФ=В");
	
КонецПроцедуры

// Раз в минуту обновляем колво сотрудников
//
Процедура ОбновитьКолвоБлюд()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказТоварыДопИнф.НомерМарки) КАК Количество
	|ИЗ
	|	РегистрСведений.ЗаказТоварыДопИнф КАК ЗаказТоварыДопИнф
	|ГДЕ
	|	ЗаказТоварыДопИнф.ГруппаПечати В(&ГруппаПечати)
	|	И ЗаказТоварыДопИнф.ВремяГотово = ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаказТоварыДопИнф.Статус В(&Статус)
	|	И ЗаказТоварыДопИнф.ВремяЗаказано > &ВремяЗаказано
	|	И ЗаказТоварыДопИнф.Количество > 0
	|");
	
	// Параметры запроса
	
	Запрос.УстановитьПараметр("ГруппаПечати"		, МестоПроизводстваСписок);
	Запрос.УстановитьПараметр("ВремяЗаказано"			, ТекущаяДата()-60*60*12); // отслеживаем марки за последние 12 часов
	СписокСтатусов = Новый Массив;
	СписокСтатусов.Добавить(Перечисления.СтатусыПозицийЗаказа.Заказано);
	СписокСтатусов.Добавить(Перечисления.СтатусыПозицийЗаказа.Удалено);
	Запрос.УстановитьПараметр("Статус"				, СписокСтатусов); // 

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
	Иначе
		Выборка.Следующий();
	Конецесли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	// заставка
	//ЭлементыФормы.ПолеКартинкиЗаставка.Картинка = БиблиотекаКартинок["ЗаставкаГлавнойФормы"+глВерсия];
	
	// неизменяемые надписи
	МестоПроизводстваСписок = Новый СписокЗначений;
    МестоПроизводстваСписок.ЗагрузитьЗначения(глПараметрыРМ.МестоПроизводстваТаблица.ВыгрузитьКолонку("МестоПроизводства"));
	Если НЕ МестоПроизводстваСписок.Количество() Тогда
		МестоПроизводстваСписок.Добавить(Справочники.ГруппыПечати.НайтиПоКоду(1));
	КонецЕсли;
	
	
	
	// периодически обновляемые надписи
	ОбновитьДатуВремя();
	ПодключитьОбработчикОжидания("ОбновитьДатуВремя", 1);
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	Если ЗначениеЗаполнено(глПользователь) Тогда
		ЭлементыФормы.тПользователь.Заголовок = глПользователь.Наименование;
	Иначе
		ЭлементыФормы.тПользователь.Заголовок = "Система заблокирована";
	КонецЕсли; 
	
	Смена = ИнтерфейсРМ.ТекущаяСмена();
	Если ЗначениеЗаполнено(Смена) Тогда
		ЭлементыФормы.НадписьСмена.Заголовок = "Смена ТТ №"+Смена.Номер+" от " + Формат(Смена.Дата,"ДФ='dd.MM.yyyy (ddd) HH:mm'") ;
	Иначе
		ЭлементыФормы.НадписьСмена.Заголовок = "СМЕНА ТТ - НЕ ОТКРЫТА"	;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ОбновитьСтопЛист" Тогда
		
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаМониторЗаказовНажатие(Элемент)
	
	Если НЕ Авторизация() Тогда
		Возврат;
		// < КС_ВДВ ------------------------------------------------------------ 
	ИначеЕсли НЕ ИнтерфейсРМ.ПроверкаПользователяСмены() Тогда
		ДействияПриВозвратеВФорму();
		Возврат;
		// КС_ВДВ > ------------------------------------------------------------ 
	КонецЕсли; 
	
	МониторМарок = ИнтерфейсРМ.ПолучитьОбъектОбработки("МониторМарок").ПолучитьФорму();
	Если МониторМарок.ПараметрыНастройки = Неопределено Тогда
		НастройкиОбъект = глПараметрыРМ.НастройкиМонитораМарокСписок[0].Значение.ПолучитьОбъект();
		Если НастройкиОбъект = Неопределено Тогда
			Текст1 = "Монитор марок";
			Текст2 = "Ошибка в настройках монитора марок"+Символы.ПС+""""+глРабочееМесто.Наименование+"""";
			ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
			Возврат; 
		КонецЕсли;	
		МониторМарок.ПараметрыНастройки = НастройкиОбъект.ПолучитьСтруктуруПараметров();
	КонецЕсли;
	МониторМарок.Открыть();
	
	ВыполнитьДействияПриВозврате = Истина;
	
КонецПроцедуры

Процедура КнопкаАвторизацияНажатие(Элемент)
	
	Авторизация( Истина );
	
КонецПроцедуры

Процедура КнопкаЗаблокироватьНажатие(Элемент)
	
	Заблокировать();
	
КонецПроцедуры

Процедура КнопкаСтопЛистНажатие(Элемент)
	
	ОткрытьСтопЛист();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ
